<?php
// กำหนดข้อความ
$str = " ตัวอย่าง   ข้อความ ที่ใช้      ในการทดสอบ    ";
// ใช้ฟังก์ชัน trim ตัดช่องว่าง ด้านหน้าและด้านหลัง
// ลดจำนวนช่องว่างภายในข้อความ
// ผลลัพธ์ที่ได้ "ตัวอย่าง ข้อความ ที่ใช้ ในการทดสอบ"
$newStr = ereg_replace('[[:space:]]+', ' ', trim($str));
echo $newStr;
?>

<!-- <p>กรณีการต้ดช่องว่างทั้งหมดออกจากข้อความ</p> -->
<?php
// กำหนดข้อความ
$str = " ตัวอย่าง   ข้อความ ที่ใช้      ในการทดสอบ    ";
// ใช้ฟังก์ชัน trim ตัดช่องว่าง ด้านหน้าและด้านหลัง
// ตัดช่องว่างภายในข้อความออกทั้งหมด
// ผลลัพธ์ที่ได้ "ตัวอย่างข้อความที่ใช้ในการทดสอบ"
$newStr = ereg_replace('[[:space:]]+', '', trim($str));
echo $newStr;
?>

<!-- Credit 03 April 2009 By Ninenik Narkdee -->